//-------------------------------------------------------------
// 文件名： "SystemTick.h"
//-------------------------------------------------------------
//功能：	1.包含SystemTick.c所用头文件
//		2.进行相关宏定义
//      3.声明全局变量
//-------------------------------------------------------------
// 作者： 刘亚彬
// 创建日期：2017年1月12日
// 修改日期：
// 版本：v0.1
//-------------------------------------------------------------

#ifndef _SYSTEMTICK_H
#define _SYSTEMTICK_H

//-------------------------------------------------------------
// INCLUDE
//-------------------------------------------------------------
#include "DSP2833x_Device.h"
#include "DSP2833x_Examples.h"
#include "GlobalDefine.h"
#include "communication.h"
#include "FpgaDriver.h"

//-------------------------------------------------------------
// 宏定义
//-------------------------------------------------------------

//-------------------------------------------------------------
// 结构体、联合体、枚举声明
//-------------------------------------------------------------
typedef struct SystemTick
{
	//属性
	State State;			//状态
	Uint16 TickPrd;			//滴答周期(ms)
	Uint32 TickCnt;			//滴答计数值

	//方法
	Uint16 (*Init)(void);	//初始化
	Uint16 (*ChangeState)(State state);		//改变状态
	Uint16 (*ScanCallback)(void);			//扫描回调函数
}SystemTick;
//-------------------------------------------------------------
// 全局变量声明
//-------------------------------------------------------------
extern SystemTick mySystemTick;
//-------------------------------------------------------------
// 函数声明
//-------------------------------------------------------------
void UseSystemTick(void);
interrupt void CpuTimer0_ISR(void);

#endif
