//-------------------------------------------------------------
// 文件名： "RS485.h"
//-------------------------------------------------------------
//功能：	1.包含RS485.c所用头文件
//		2.进行相关宏定义
//      3.声明全局变量
//-------------------------------------------------------------
// 作者： 刘亚彬
// 创建日期：2017年1月14日
// 修改日期：
// 版本：v0.1
//-------------------------------------------------------------

#ifndef _RS485_H
#define _RS485_H

//-------------------------------------------------------------
// INCLUDE
//-------------------------------------------------------------
#include "DSP2833x_Device.h"
#include "DSP2833x_Examples.h"
#include "GlobalDefine.h"
#include "communication.h"

//-------------------------------------------------------------
// 宏定义
//-------------------------------------------------------------
#define RS485_ADD 3							//RS485设备地址

#define RS485 myCommunication.RS485Com
#define RS485_FIFO_SEND_NUM 10							//一次向FIFO发送缓冲区中写入的最多数据个数，不能超过14
#define RS485_SEND_END_TICK 10							//定义数据扔到缓冲区后到发送完毕后的时间N~N-1(系统滴答数)
#define RS485_RECF_END_TICK 3							//定义一帧内两个接收字节间隔最大值N~N+1(系统滴答数)

#define RS485_TXENABLE 	GpioDataRegs.GPBSET.bit.GPIO61 = 1			//置位
#define RS485_RXENABLE  GpioDataRegs.GPBCLEAR.bit.GPIO61 = 1		//复位

//-------------------------------------------------------------
// 全局变量声明
//-------------------------------------------------------------

//-------------------------------------------------------------
// 函数声明
//-------------------------------------------------------------
void UseRS485(void);
interrupt void ScicTx_ISR(void);
interrupt void ScicRx_ISR(void);

#endif
